#version: 0.2
o n
0 0
X X
a l
i d
n t
Ġ a
a t
e d
i on
m e
t h
v al
Ġ w
Ġ val
id at
Ġval idat
Ġvalidat ion
c o
Ġ p
p l
a y
XX XX
me nt
ay ment
0 2
2 02
P A
i th
o u
Ġ D
Ġ on
Ġ 202
Ġ PA
Ġw ith
Ġ202 5
a s
i s
p pl
r o
s ed
â Ĥ
Ġ f
Ġ th
Ġ âĤ
Ġa ppl
Ġp ayment
ĠâĤ ¹
Ġappl i
0 6
8 8
E D
S S
e t
l e
m pl
t co
u al
Ġ co
Ġ ou
00 0
ĠD ual
ĠPA SS
et ed
mpl eted
tco me
Ġco mpleted
Ġou tcome
ĠPASS ED
0 7
3 9
5 000
E N
F i
I s
M EN
P ayment
Y MEN
a b
b o
c e
c co
c ab
e n
h en
m ou
o f
o r
r s
s sed
u nt
v e
Ġ al
Ġ XXXX
Ġ is
Ġ Is
Ġ of
00 00
Ġa bo
Ġa cco
Ġa mou
Ġw as
Ġw hen
Ġvalidation s
Ġp as
Ġp ro
ĠD id
ĠPA YMEN
Ġ2025 06
ro m
Ġf or
Ġf rom
Ġth e
Ġth is
Ġappli ed
Ġappli cab
Fi rs
ce ssed
Ġal l
ĠXXXX XXXX
Ġabo ve
Ġacco unt
Ġamou nt
Ġpas sed
Ġpro cessed
ĠPAYMEN T
Ġ202506 0
Ġapplicab le
Firs t
